---
kind: property
id: P:Autodesk.Revit.DB.RoutingPreferenceRule.MEPPartId
source: html/030e41b5-abab-6e90-d383-bf18de43c083.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRule.MEPPartId Property

The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.

## Syntax (C#)
```csharp
public ElementId MEPPartId { get; }
```